Repository: ArtanisTheOne/discord-translator-i18n
Catalog: */errors.po
Languages: es, ja, pl

source: **Embed Links** permission is required, please fix or tell an admin.
es: **Enlaces incrustados**, es requerida una autorización, por favor reparar o notificar a un administrador.
ja: **埋め込みリンク** 権限が必要です。修正するか、管理者に伝えてください。
pl: **Osadź Linki** wymagana jest zgoda, proszę naprawić lub powiedzieć administratorowi.

source: Interactions via Direct/Private messages with bot have been **disabled**.
es: Interacciones via mensajes directos/privados entre ambos han sido **desabilitados**.
ja: ボットとのダイレクト/プライベートによるメッセージのやり取りは**無効**になっています。
pl: Interakcje poprzez Bezpośrednie/Prywatne wiadomości z botem zostały **wyłączone**.

source: Missing Arguments
es: Argumento faltante
ja: 引数がありません
pl: Brakujące Argumenty

source: Missing valid languages and text for translation, please edit to fix.
es: Falta el lenguaje válido y el texto para la traducción, por favor editar para arreglar.
ja: 有効な言語と翻訳のテキストがありません。編集して修正してください。
pl: Brak poprawnych języków i tekstu do tłumaczenia, proszę edytować aby naprawić.

source: Missing Text
es: Texto faltante
ja: テキストがありません
pl: Brakujący Tekst

source: Please provide some text for language detection.
es: Por favor proveer de texto para detectar el idioma.
ja: 言語を検出するためのテキストを入力してください。
pl: Proszę podać tekst, aby wykryć język.

source: To translate a message, you *need* a message! Please edit your command to include text.
es: ¡Para traducir un mensaje, tu *necesitas* un mensaje! Por favor edita tu comando para incluir texto.
ja: メッセージを翻訳するには、メッセージが*必要*です！ テキストを含むようにコマンドを編集してください。
pl: Aby przetłumaczyć wiadomość *potrzebujesz* wiadomości! Proszę edytować swoją komendę włączając w jej treść tekst.

source: Invalid languages argument
es: Argumento invalido de los idiomas
ja: 無効な言語の引数
pl: Nieprawidłowy argument językowy

source: Incorrect format for from/to argument, please edit to fix.
es: Formato incorrecto para desde/a del argumento, por favor editar para corregir.
ja: from/to引数の形式が正しくありません。編集して修正してください。
pl: Błędny format od/do argumentu, proszę edytować, aby naprawić.

source: Missing Permissions
es: Permisos faltantes
ja: 権限がありません
pl: Brakujące Uprawnienia

source: Please fix that if you're an administrator.
es: Por favor reparar si eres un administrador.
ja: あなたが管理者の場合は修正してください。
pl: Proszę to naprawić jeżeli jesteś administratorem.

source: Bot does not have **Manage Roles** or **Manage Nicknames** permissions on this server.
es: El robot no tiene permisos de **Roles administrativos** o **Sobrenombres administrativos** en este servidor.
ja: Botにはこのサーバーの **役職の管理** または **ニックネームの管理** 権限はありません。
pl: Bot nie ma uprawnień do **Zarządzanie rolami** lub **Zarządzanie pseudonimami** na tym serwerze.

source: Bot cannot assign the role **%s** because it is beyond the bot's highest role. You can fix it by **moving** the bot's primary role (`%s`) higher in the roles list.
es: El robot no puede asignar el rol **%s** porque es superior a su rol más alto. Puedes repararlo **moviendo** el rol primario del robot (`%s`) al punto más alto de la lista.
ja: BotはBotの現在の権限より高い権限 **%s** を割り当てることができません。役職リストでBotの主要な役職を **動かす** ことで修正できます。
pl: Bot nie może przypisać roli **%s**, ponieważ jest poza najwyższą rolą bota. Możesz to naprawić, **przenosząc** główną rolę bota (`%s`) wyżej na liście ról.

source: Invalid Channel
es: Canal invalido
ja: チャンネルが無効です
pl: Nieprawidłowy Kanał

source: The channel %s seems to be either **invalid** or **unreachable** in your server. Contact an administrator for support.
es: El canal %s parece ser ya sea **invalido** o **inalcanzable** en tu servidor. Contacta un administrador para soporte.
ja: チャンネル %s は、ご使用のサーバーで **無効** または **到達不可** のいずれかのようです。サポートについては、管理者にお問い合わせください。
pl: Kanał %s wydaje się być **nieważny** lub **nieosiągalny** na twoim serwerze. Skontaktuj się z administratorem, aby uzyskać pomoc.

source: Invalid Language(s)
es: Idioma(s) inválido(s)
ja: 言語が無効です。
pl: Nieprawidłowy Język(-i)

source: Translator could not recognize the following as valid languages:
es: El traductor no pudo reconocer los siguientes como idiomas válidos:
ja: Translatorは以下を有効な言語として認識できませんでした：
pl: Translator nie mógł rozpoznać następujących języków:

source: Missing Language
es: Idioma faltante
ja: 言語がありません
pl: Brakujący Język

source: Please specify a **valid language** for translation (Can be ISO code or name).
es: Por favor especificar un **idioma válido** para traducción (puede ser código ISO o nombre).
ja: 翻訳には **有効な言語** を指定してください（ISOコードまたは名前が使用可能）。
pl: Proszę podać **poprawny język ** do tłumaczenia (może to być kod ISO lub nazwa).

source: Explain yourself
es: Explicate
ja: どういうことか説明してくれ
pl: Wytłumacz się

source: One does not simply translate to `Auto`
es: Uno simplemente no traduce a `Automático`
ja: `自動`翻訳は簡単にできるものではない
pl: Nie można po prostu tłumaczyć na `Auto`

source: Bad Text Format
es: Mal formato de texto
ja: 不正なテキスト形式
pl: Zły Format Tekstu

source: The supplied translation text has an invalid format.
es: La traducción del texto proporcionado tiene un formato inválido.
ja: 指定された翻訳テキストの形式が無効です。
pl: Podany tekst tłumaczenia ma nieprawidłowy format.

source: Please report the issue at the official **[support server](%s)**.
es: Por favor reporta este problema al **[servidor de soporte](%s)** oficial.
ja: 公式**[サポートサーバー] (%s)**に問題を報告してください。
pl: Proszę zgłosić błąd na oficjalnym **[serwerze wsparcia](%s)**.

source: Bad User
ja: 良くないユーザー
pl: Zły Użytkownik

source: Some bots and banned users are not allowed to be auto translated.
es: Algunos robots y usuarios bloqueados no tienen permitido traducción automática.
ja: ボットや禁止されているユーザーの中に、自動翻訳が許可されていないものが含まれています。
pl: Niektóre boty i zbanowani użytkownicy nie mogą być tłumaczeni automatycznie.

source: If this is a mistake, please report the issue at the official **[support server](%s)**.
es: Si es un error, por favor reportar este problema al **[servidor de soporte](%s)** oficial.
ja: これが間違いの場合は、公式**[サポートサーバー](%s)**に問題を報告してください。
pl: Jeśli to pomyłka, zgłoś problem na oficjalnym **[serwerze wsparcia](%s)**.

source: Invalid Translation Data
es: Datos inválidos de traducción
ja: 翻訳データが無効です
pl: Nieprawidłowe Tłumaczenie Danych

source: Looks like something went wrong while processing your request.
es: Parece que algo salió mal mientras se procesaba tu solicitud.
ja: あなたの要求した処理は何かが間違っているようです。
pl: Wygląda na to, że coś poszło nie tak podczas przetwarzania twojego żądania.

source: Text is too looong
es: El texto es muuuy laaaaargo
ja: テキストがながーーーいです
pl: Tekst jest zaa dłuuuugi

source: Could you please split your message into smaller chunks? Thanks!
es: ¿Podrías dividir tu mensaje en partes más pequeñas? ¡Gracias!
ja: メッセージを小分けにしてください。どうも！
pl: Czy mógłbyś podzielić wiadomość na mniejsze części? Dzięki Wielkie!

source: Google is Angry
es: Google está enojado
ja: Googleはご立腹です
pl: Google jest Zły

source: Translation refused by Google.
es: Traducción rechazada por Google.
ja: 翻訳がGoogleに拒否されました。
pl: Tłumaczenie odrzucone przez Google.

source: Role Assignment Failed
es: Asignación del rol fallido
ja: 役職の割当に失敗しました
pl: Przypisywanie Ról Nawaliło

source: Could not update user's role due to a Discord error.
es: No se pudo actualizar el rol del usuario debido a un error de Discord.
ja: Discordのエラーによりユーザーの役職を更新できませんでした。
pl: Nie można zaktualizować roli użytkownika przez błąd Discorda.

source: Send Error
es: Enviar error
ja: 送信エラー
pl: Wyślij Błąd

source: Discord refused to deliver message.
es: Discord se negó a enviar el mensaje.
ja: Discordはメッセージを届けるのを嫌がりました。
pl: Discord odmówił dostarczenia wiadomości.

source: Flag Reaction Limit
es: Bandera límite de reacción
ja: フラッグリアクション上限
pl: Limit Reakcji Flagą

source: That message has been translated to too many languages and cannot be translated any further...
es: Ese mensaje ha sido traducido a muchos idiomas y no puede traducirse más...
ja: そのメッセージはあまりにも多くの言語に翻訳されているので、これ以上翻訳できません...
pl: Ta wiadomość została przetłumaczona na zbyt dużą liczbę języków i nie może być dłużej tłumaczona...

source: Missing Access to History
es: Historia de acceso faltante
ja: 履歴へのアクセス権限がありません
pl: Brak Dostępu do Historii

source: The bot cannot view **message history** here. Please enable that to properly translate old messages written in this channel.
es: El robot no puede ver aquí la **historia del mensaje**. Por favor habilitarlo para traducir correctamente mensajes antiguos escritos en este canal.
ja: ボットは**メッセージの履歴**を見ることはできません。このチャンネルで書かれた古いメッセージを正しく翻訳するにはこの機能を有効にしてください。
pl: Bot nie może wyświetlić tutaj **historii wiadomości**. Proszę włączyć tę funkcję, aby poprawnie tłumaczyć starsze wiadomości napisane na tym kanale.

source: Command Disabled (%s)
es: Comando deshabilitado (%s)
ja: コマンド無効 (%s)
pl: Komenda Wyłączona (%s)

source: The `last` translation command has been disabled in favour of **reactions** and **automatic** translations, and also to prevent abuse.
es: El `último` comando de traducción ha sido deshabilitado en favor a **reacciones** y traducciones **automáticas**, y también para prevenir abuso.
ja: `最後`の翻訳コマンドは**リアクション**や**自動**翻訳の乱用防止のために無効化されています。
pl: Komenda `ostatniego` tłumaczenia została wyłączona na rzecz **reakcji** i **automatycznych** tłumaczeń, a także w celu zapobiegania nadużyciom.

source: Invalid Channels in Group
es: Canales inválidos en el grupo
ja: グループ内の無効なチャンネル
pl: Nieprawidłowe Kanały w Grupie

source: Could **not** auto translate to the following channels:
es: Podrías **no** auto traducir los siguientes canales:
ja: 次のチャンネルに自動翻訳できま**せんでした** :
pl: **Nie** może automatycznie tłumaczyć następujących kanałów:

source: Please make sure the bot has **read**, **send**, **embed links** and **history** permissions in all channels.
es: Por favor asegúrese que el robot tiene los permisos **leído**, **enviado**, **incurstado enlaces** e **historia** en todos los canales.
ja: ボットが全てのチャンネルで**メッセージを読む**、**メッセージを送信**、**埋め込みリンク**、**メッセージ履歴を読む**の全ての権限を持っていることを確認してください。
pl: Upewnij się, że bot ma uprawnienia do **czytaj**, **wysyłaj**, **załącz linki** i **historia** na wszystkich kanałach.

source: The `%s` command is reserved for server **moderators** and **admins** only.
es: El comando `%s` está reservado sólo para **moderadores** y **administradores** del servidor.
ja: `%s`コマンドはサーバーの**モデレーター**と**管理者**のとっておきのコマンドです。
pl: Komenda `%s` jest zarezerwowana tylko dla **moderatorów** i **administratorów** serwera.

source: The `%s` command is reserved for server **administrators** only.
es: El comando `%s` está reservado sólo para **administradores** del servidor.
ja: `%s`コマンドはサーバー**管理者**だけのとっておきのコマンドです。
pl: Komenda `%s` jest zarezerwowana tylko dla **administratorów** serwera.

source: This channel is **not** part of any automatic translation group.
es: Este canal **no** es parte de un ningún grupo de traducción automática.
ja: このチャンネルは自動翻訳グループの一部に入っていま**せん**。
pl: Ten kanał **nie** jest częścią żadnej grupy automatycznego tłumaczenia.

source: Please make sure the name is %d to %d characters long.
es: Por favor asegúrese que el nombre sea de %d a %d caracteres de largo.
ja: 名前が%dから%d文字であることを確認してください。
pl: Upewnij się, że nazwa zawiera od %d do %d znaków.

source: Invalid Auto Mode
es: Modo automático inválido
ja: 無効な自動モード
pl: Nieprawidłowy Tryb Auto

source: Invalid Style
es: Estilo inválido
ja: 無効なスタイル
pl: Nieprawidłowy Styl

source: `%s` is **not** a valid text style. The allowed styles are:
es: `%s` **no** es un estilo de texto válido. Los estilos permitidos son:
ja: `%s`は有効なスタイル**ではありません**。許可されているスタイルは次のとおりです :
pl: `%s` **nie** jest poprawnym stylem tekstu. Dopuszczalne style to:

source: Nickname Error
es: Error de sobrenombre
ja: ニックネームエラー
pl: Błąd Nicku

source: Could not change the user's nickname while setting custom language. This usually happens if the user is an **admin** or **server owner**.
es: No se pudo cambiar el sobrenombre del usuario mientras se configuraba el idioma personalizado. Esto sucede usualmente si el usuario es un **admin** o **propietario del servidor**.
ja: カスタム言語の設定中にユーザーのニックネームを変更できませんでした。これは通常、ユーザーが**管理者**か**サーバーの所有者**だった場合に発生します。
pl: Nie można zmienić pseudonimu użytkownika podczas ustawiania niestandardowego języka. Zazwyczaj dzieje się tak, jeśli użytkownik jest **administratorem** lub ** **właścicielem serwera**.

source: In this case, change the user's nickname manually to add `--lang` at end like the following example:
es: En este caso, cambie el sobrenombre del usuario manualmente para agregar `--lang` al final, como en el siguiente ejemplo:
ja: この場合、次の例のように最後に`--lang`を追加するようにユーザーのニックネームを手動で変更してください :
pl: W takim przypadku zmień ręcznie pseudonim użytkownika dodając końcówkę `--lang`, jak na poniższym przykładzie:

source: Bad Request
es: Solicitud fallida
ja: 要求形式が正しくありません
pl: Zła Prośba

source: Could not handle your request.
es: No se pudo manejar su solicitud.
ja: あなたの要求を処理できませんでした。
pl: Nie można obsłużyć twojego żądania.

source: Bad Data
es: Datos inválidos
ja: 良くないデータ
pl: Złe Dane

source: Could not handle your request due to an internal error.
es: No se pudo manejar su solicitud debido a un error interno.
ja: 内部エラーが原因でリクエストを処理できませんでした。
pl: Nie można obsłużyć twojego żądania z powodu błędu wewnętrznego.

source: Your server has reached its **maximum allowed** auto groups quota.
es: Tu servido ha alcanzado su cuota **máxima permitida** de auto grupos.
ja: サーバーが許可されている**最大許容**自動グループ割当数に達しました。
pl: Twój serwer osiągnął **maksymalny dozwolony** limit grup automatycznych.

source: The group **`%s`** has reached its **maximum** allowed linked channels.
es: El grupo **`%s`** ha alcanzado el **máximo** de canales enlazados permitidos.
ja: グループ**`%s`**は**最大**許容のリンクされたチャンネル数に達しました。
pl: Grupa **`%s`** osiągnęła **maksymalną** liczbę połączonych kanałów.

source: Your server has reached its **%s** translation quota of **%s** characters.
es: Tu servidor ha alcanzado su **%s** cuota de traducciones **%s** de caracteres.
ja: サーバーが**%s**文字の**%s**翻訳割当数に達しています。
pl: Twój serwer osiągnął limit **%s** dla **%s** znaków.

source: Voice Connection Failed
es: Conexión de voz fallida
ja: 音声接続に失敗しました
pl: Połączenia Głosowe nie powiodło się

source: Bot could not join the voice channel, please check if it has the neccessary permissions.
es: No se pudo unir al canal de voz, por favor revise si tiene los permisos necesarios.
ja: ボットがボイスチャンネルに参加できませんでした。必要な権限が割り当てられているか確認してください。
pl: Bot nie mógł połączyć się na kanał głosowy, proszę sprawdzić czy ma niezbędne uprawnienia.

source: Voice Channel Full
es: Canal de voz lleno
ja: ボイスチャンネルがいっぱいです
pl: Kanał Głosowy Zapełniony

source: Bot could not join the voice channel, because it is **full**!
es: El robot no pudo unir el canal de voz, ¡porque está **lleno**!
ja: ボットはボイスチャンネルが**いっぱい**なので参加できませんでした！
pl: Bot nie mógł dołączyć na kanał głosowy, ponieważ jest **pełny**!

source: You have to be **connected** to a **Voice Channel** for transmitting translated TTS messages.
es: Debes estar **conectado** a un **Canal de voz** para transmitir mensajes TTS traducidos.
ja: 翻訳されたTTSメッセージを送信するには、**ボイスチャンネル**に**接続**する必要があります。
pl: Musisz być **połączony** z **Kanałem Głosowym** aby przesyłać przetłumaczone wiadomości TTS.

source: Text to Speech Failed
es: Texto a voz fallido
ja: テキスト読み上げに失敗
pl: Syntezator Mowy Nawalił

source: Could not proccess your TTS request.
es: No se pudo procesar tu solicitud TTS.
ja: TTSリクエストを処理できませんでした。
pl: Nie można przetworzyć twojego żądania TTS.

source: Missing Voice Permissions
es: Faltan los permisos de voz
ja: 音声の権限がありません
pl: Brakujące Uprawnienia Głosowe

source: Please make sure the bot has **Speak** and **Connect** permissions for the Voice Channel.
es: Por favor asegúrese que el robot tiene los permisos **Hablar** y **Conectar** en el canal de voz.
ja: ボットにボイスチャンネルの**発言**と**接続**権限があることを確認してください。
pl: Upewnij się, że bot ma uprawnienia **Mów** i **Połącz** na Kanał Głosowy.

source: But wait!
es: ¡Espera!
ja: チョット待って！
pl: Czekaj!

source: It seems that **%s** is already set for **%s**.
es: Parece que **%s** ya ha sido asignado para **%s**.
ja: **%s**はすでに**%s**が設定されているようです。
pl: Wygląda na to, że **%s** jest już ustawiony dla **%s**.

source: Free Service Disabled
es: Servicio gratuito deshabilitado
ja: 無料サービス無効
pl: Bezpłatna Obsługa Wyłączona

source: The free translation service of Discord Translator has ended, to use the bot, you must __pay__ for a premium plan.
es: El servicio gratuito de traducción del Traductor de Discord ha finalizado, para usar el robot, debes __pagar__ para un plan premium.
ja: Discord Translatorの無料翻訳サービスが終了しました。ボットを使用するにはプレミアムプランを__購入__する必要があります。
pl: Bezpłatne usługi tłumaczeniowe Discord Translator dobiegły końca, aby móc nadal używać bota musisz zapłacić za plan premium.

source: Text to Speech Disabled
es: Texto a voz deshabilitado
ja: 読み上げ機能無効
pl: Syntezator Mowy Wyłączony

source: This experimental feature has been disabled due to bad performance. It will be added back once the lag issues are resolved.
es: Esta opción experimental ha sido deshabilitada debido a un mal desempeño. Será agregada de nuevo cuando el problema del retardo sea solucionado.
ja: この実験的な機能は、パフォーマンスが悪いため無効になっています。ラグの問題が解決されると追加されます。
pl: Ta eksperymentalna funkcja została wyłączona z powodu złej wydajności. Zostanie ona dodana z powrotem po rozwiązaniu problemów z opóźnieniem.

source: This channel is **not** linked to an automatic group.
es: Este canal **no** está vinculado a un grupo automático.
ja: このチャンネルは自動グループにリンクされて**いません**。
pl: Ten kanał **nie** jest połączony z automatyczną grupą.

source: Attention:
es: Atención:
ja: 注意 :
pl: Uwaga:

source: This server has reached its maximum allowed character translation quota.
es: Este servidor ha alcanzado la cuota máxima permitida de caracteres a traducir.
ja: このサーバーは最大翻訳可能文字数クオーターに達しました。
pl: Ten serwer osiągnął maksymalny, dopuszczalny limit translacji znaków.

source: The bot will not translate any more messages.
es: El robot no traducirá mas mensajes.
ja: ボットはこれ以上メッセージを翻訳しません。
pl: Bot nie przetłumaczy już żadnych wiadomości.

source: Consider renewing or extending your premium plan.
es: Considere renovar o extender su plan premium.
ja: プレミアムプランを更新、または延長することを検討してください。
pl: Rozważ odnowienie lub rozszerzenie swojego planu premium.

# direct messages
source: DMs Disabled
es: Mensajes directos deshabilitados
ja: DM無効
pl: PW Wyłączone

# channel
source: Bot does not have **read**/**write**/**embed** permissions at %s
es: El robot no tiene permisos de **leer**/**escribir**/**incrustar** en %s
ja: ボットは%sで**メッセージを読む**/**メッセージを送信**/**埋め込みリンク**の権限を持っていません
pl: Bot nie ma uprawnień do **czytania**/**pisania**/osadzania** na %s

# admin
source: If you are one, and still having issues, please report to the **[support server](%s)**.
es: Si eres uno, y aún tienes problemas, por favor reportarlo al **[servidor de soporte](%s)**.
ja: もし、まだ問題がある場合は、**[サポートサーバー](%s)**に報告してください。
pl: Jeśli nim jesteś i nadal występują problemy, proszę zgłoś to nam na **[serwerze wsparcia](%s)**.

# auto
source: Channel not part of Group
es: Este canal no es parte del grupo
ja: チャンネルはグループの一部ではない
pl: Kanał nie jest częścią Grupy

# auto
source: Invalid Group Name
es: Nombre inválido del grupo
ja: 無効なグループ名
pl: Nieprawidłowa Nazwa Grupy

# name
source: `%s` is **not** a valid group name.
es: `%s` **no** es un nombre válido de grupo.
ja: `%s`は有効なグループ名**ではありません**。
pl: `%s` **nie** jest prawidłową nazwą grupy.

# command
source: Invalid Prefix
es: Profijo inválido
ja: 無効な接頭辞
pl: Nieprawidłowy Prefiks

# command
source: `%s` is **not** a valid prefix code.
es: `%s` **no** es un código de prefijo válido.
ja: `%s`は有効な接頭符号**ではありません**。
pl: `%s` **nie** jest prawidłowym kodem prefiksu.

# mode
source: `%s` is **not** a valid mode for auto translation. The allowed modes are:
es: `%s` **no** es un modo válido para auto traducción. Los permitidos son:
ja: `%s`は自動翻訳の有効なモード**ではありません**。許可されているモードは次のとおりです :
pl: `%s` **nie** jest prawidłowym trybem dla automatycznego tłumaczenia. Dozwolonymi trybami są:
