Repository: ArtanisTheOne/discord-translator-i18n
Catalog: */main.po
Languages: es, ja, pl

source: Total Channels
es: Total de canales
ja: 総チャンネル数
pl: Całkowita liczba Kanałów

source: If you enjoy using this bot then please consider helping with its growth by various promotional actions listed below:
es: Si disfrutas utilizar el robot, por favor considera ayudar con su crecimiento a través de varias acciones promocionales, listadas a continuación:
ja: もしこのボットがいいなと思ったら、下記のような様々な宣伝活動でさらなる発展を助けることを検討してください :
pl: Jeżeli lubisz korzystać z tego bota to proszę rozważyć pomoc w jego rozwoju poprzez różne działania promocyjne wymienione poniżej:

source: How you can help
es: Como puedes ayudar
ja: あなたができる援助方法
pl: Jak możesz pomóc

source: Upvote bot on [DBL](%s)
es: Vota por el bot en [DBL](%s)
ja: [DBL](%s)にボットを投票
pl: Łapkuj bota na [DBL](%s)

source: Follow and share bot on [Twitter](%s)
es: Sigue y comparte el robot en [Twitter](%s)
ja: [Twitter](%s)にボットをフォロー&共有
pl: Śledź i Udostępnij bota na [Twitterze](%s)

source: Follow and review bot on [Botlist.co](%s)
es: Sigue y reseña el robot en [Botlist.co](%s)
ja: [Botlist.co](%s)にボットをフォロー&レビュー
pl: Śledź i zrecenzuj bota na [Botlist.co](%s)

source: Make a [video review](%s)
es: Haz un [video reseña](%s)
ja: [ビデオレビュー](%s)を作成
pl: Nagraj [wideo recenzję](%s)

source: Share bot on [social media](%s)
es: Comparte el robot en las [redes sociales](%s)
ja: [ソーシャルメディア](%s)にボットを共有
pl: Poleć bota na [social mediach](%s)

source: Join [translation team](%s)
es: Únete al [equipo de traducción](%s)
ja: [翻訳チーム](%s)に参加
pl: Dołącz do [zespół tłumaczy](%s)

source: Other [ads/promotional acts](%s)
es: Otros [anuncios/actos promocionales](%s)
ja: その他[広告/宣伝行為](%s)
pl: Inne [reklamy/akcje promocyjne](%s)

source: Supporters will be given VIP status and interesting perks
es: A los partidarios se les dará estatus VIP y ventajas interesantes
ja: サポーターにはVIPの地位と嬉しい特典が与えられます
pl: Wspierający otrzymają VIP status i interesujące profity

source: Special roles on the official bot server
es: Roles especiales en el servidor oficial del robot
ja: 公式ボットサーバー上の特別な役職
pl: Specjalną rolę na oficjalnym serwerze bota

source: Access to beta features
es: Acceder a características Beta
ja: ベータ機能へのアクセス
pl: Dostęp do funkcji beta

source: Discounts on premium plans
es: Descuentos en planes premium
ja: プレミアムプランの割引
pl: Zniżki na plany premium

source: The detected language is **%s** ( %s / `%s` ).
es: El idioma detectado es **%s** ( %s / `%s` ).
ja: 検出された言語は**%s**(%s / `%s`)です。
pl: Wykrytym językiem jest **%s** ( %s / `%s` ).

source: Command Prefix
es: Prefijos de comando
ja: 接頭辞コマンド
pl: Prefiks komendy

source: Channels
es: Canales
ja: チャンネル
pl: Kanały

source: Character Quotas / Limits
es: Cuotas de caracteres / límites
ja: 文字数 クオータ / 上限
pl: Przedziały/Limity znaków

source: Today
es: Hoy
ja: 今日
pl: Dziś

source: Month
es: Mes
ja: 月
pl: Miesiąc

source: Total
ja: 合計
pl: Ogólnie

source: Server's default language is **%s**
es: El idioma predeterminado del servidor es **%s**
ja: サーバーのデフォルト言語は**%s**です
pl: Domyślnym językiem serwera jest **%s**

source: Updated server's language to **%s**
es: El lenguaje del servidor se ha actualizado a **%s**
ja: サーバーの言語を**%s**に更新しました
pl: Zaktualizowano język serwera do **%s**

source: Server's current text style is **%s**
es: El estilo de texto actual del servidor es **%s**
ja: サーバーの現在のテキストスタイルは**%s**です
pl: Obecny styl tekstu serwera to **%s**

source: Server's text style has been updated to **%s**
es: El estilo de texto del servidor se ha actualizado a **%s**
ja: サーバーのテキストスタイルが**%s**に更新されました
pl: Styl tekstu serwera został zaktualizowany do **%s**

source: Server's current prefix is **`%s`**
es: El prefijo actual del servidor es **`%s`**
ja: サーバーの現在の接頭辞は**`%s`**です
pl: Aktualny prefiks serwera to **`%s`**

source: To change prefix, type:
es: Para cambiar el prefijo, escribe:
ja: 接頭辞を変更するには、次のように入力します :
pl: Aby zmienić prefiks, napisz:

source: Server's prefix has been updated to **`%s`**
es: El prefijo del servidor ha sido actualizado a **`%s`**
ja: サーバーの接頭辞が**`%s`**に更新されました
pl: Prefiks serwera został zaktualizowany do **`%s`**

source: Linked Channels
es: Canales vinculados
ja: リンクされたチャンネル
pl: Powiązane Kanały

source: This server does **not** have any automatic translation groups
es: Este servidor **no** tiene ningún grupo de traducción automático
ja: このサーバーには自動翻訳グループが**ありません**
pl: Ten serwer **nie** ma żadnych automatycznie tłumaczonych grup

source: To create an automatic group, type:
es: Para crear un grupo automático, escribe:
ja: 自動グループを作成するには、次のように入力します :
pl: Aby utworzyć grupę automatyczną, napisz:

source: List of Server Auto Groups
es: Lista de los grupos automáticos del servidor
ja: サーバーオートグループの一覧
pl: Lista Automatycznych Grup Serwerowych

source: No Limit
es: Sin límite
ja: 制限なし
pl: Bez Limitu

source: Will not work in **auto-translated** channels
es: No trabajará en canales **auto-traducidos**
ja: **自動翻訳**チャンネルでは機能しません
pl: Nie będzie działać na **automatycznie-tłumaczonych** kanałach

source: Will not work in **ignored / blocked** channels
es: No trabajará en canales **ignorados/bloqueados**
ja: **無視された/ブロックされた**チャンネルでは機能しません
pl: Nie będzie działać na **ignorowanych/zablokowanych** kanałach

source: Will not work if user has %s role
es: No trabajará si el usuario tiene un rol %s
ja: ユーザーが%sの役職を持っていると動作しません
pl: Nie będzie działać, jeżeli użytkownik ma rolę %s

# example
source: Hello World
es: Hola mundo
ja: こんにちは世界
pl: Witaj Świecie

# example
source: result:
es: resultado:
ja: 結果 :
pl: wynik:

# example
source: I love you
es: Te quiero
ja: 愛してる
pl: Kocham cię

# example
source: how are you?
es: ¿Cómo estas?
ja: 調子はどう？
pl: jak się masz?

# auto mode
source: Send and Receive
es: Enviar y recibir
ja: 送信と受信
pl: Wysyłanie i Otrzymywanie

# auto mode
source: Send only
es: Solo enviar
ja: 送信のみ
pl: Tylko Wysyłanie

# auto mode
source: Receive only
es: Solo recibir
ja: 受信のみ
pl: Tylko Otrzymywanie

# quota
source: Would you like to extend it? Consider advanced **Premium** plans.
es: ¿Desearía extenderlo? Considere planes **Premium** avanzados.
ja: それを拡張しますか？上級**プレミアム**プランを検討してみてください。
pl: Czy chcesz go przedłużyć? Zastanów się nad zaawansowanymi planami **Premium**.

# voice
source: Please wait for bot to finish speaking the current TTS message..
es: Por favor espere a que el robot termine de hablar el mensaje TTS actual.
ja: ボットが現在のTSSスーパーニュースメッセージを終了するのを待ってください。。
pl: Poczekaj aż bot skończy mówić bieżącą wiadomość TTS..

# user
source: %s said:
es: %s dice:
ja: %s は言った :
pl: %s powiedział:

# user
source: Messages by %s will now be auto translated to **%s**
es: Ahora los mensajes de %s se auto traducirán a **%s**
ja: %sのメッセージは**%s**に自動変換されるようになりました
pl: Wiadomości %s zostaną automatycznie przetłumaczone na **%s**

# to
source: channel's default language
es: idioma predeterminado del canal
ja: チャンネルのデフォルト言語
pl: domyślny język kanału

# user
source: **Stopped** auto translating messages by %s.
es: Auto traducir se ha **detenido** por %s.
ja: %sがメッセージの自動翻訳機能を**停止しました**。
pl: **Zatrzymano** automatyczne tłumaczenie wiadomości przez %s.

# user
source: %s is **not** being auto translated.
es: %s **no** se esta traduciendo automáticamente.
ja: %sは自動翻訳されて**いません**。
pl: %s **nie** jest tłumaczony automatycznie.

# user
source: %s is already banned from using **Translator** bot.
es: %s ya ha sido restringido de usar el robot **traductor**.
ja: %sはすでに**Translator**ボットを使用できません。
pl: %s jest już zbanowany z używania **Tłumacz** bota.

# user
source: %s has been **banned** from using the **Translator** bot.
es: %s ha sido **bloqueado** de usar el robot **traductor**.
ja: %sは**Translator**ボットを使用することを**禁止されています**。
pl: %s jest **zbanowany** z używania **Tłumacz** bota.

# user
source: %s is now allowed to use **Translator** bot.
es: %s ahora se le ha permitido usar el robot **traductor**.
ja: %sは**Translator**ボットを使用できるようになりました。
pl: %s jest teraz uprawniony do użycia **Tłumacz** bota.

# user
source: %s is already allowed to use **Translator** bot.
es: %s ya se le ha permitido el uso del robot **traductor**.
ja: %sはすでに**Translator**ボットを使用することができます。
pl: %s jest już uprawniony do użycia **Tłumacz** bota.

# value
source: %s - Server Default
es: %s - Predeterminado del servidor
ja: %s - サーバーデフォルト
pl: %s - Serwer Domyślny

# value
source: (default)
es: (predeterminado)
ja: （デフォルト）
pl: (domyślna)

# value
source: Not Set
es: No asignado
ja: 設定されていません
pl: Nie Ustawiona

# value
source: new language
es: nuevo idioma
ja: 新しい言語
pl: nowy język

# value
source: group name
es: nombre de grupo
ja: グループネーム
pl: nazwa grupy

# channels
source: %d linked
es: %d vinculado
ja: %dリンク済み
pl: %d połączone

# messages
source: Translated
es: Traducido
ja: 翻訳した
pl: Przetłumaczone

# channel
source: %s **updated**:
es: %s **actualizado**:
ja: %s **更新** :
pl: %s **zaktualizowany**:

# channel
source: %s's current language is **%s**
es: %s's el idioma actual es **%s**
ja: %sの現在の言語は**%s**です
pl: Obecnym językiem %s jest **%s**

# channel
source: Updated %s's language to **%s**
es: Se ha actualizado el idioma %s's a **%s**
ja: %sの言語を**%s**に更新しました
pl: Zaktualizowano język %s na **%s**

# channel
source: %s's current group is **%s**
es: %s's el grupo actual es **%s**
ja: %sの現在のグループは**%s**です
pl: Obecna grupa %s to **%s**

# channel
source: %s has been added to the **%s** group.
es: %s ha sido agregado al grupo **%s**.
ja: %sは**%s**グループに追加されました。
pl: %s został dodany to grupy **%s**.

# channel
source: %s's current mode is **%s**
es: %s's el modo actual es **%s**
ja: %sの現在のモードは**%s**です
pl: Obecny tryb %s to **%s**

# channel
source: %s's auto mode has been updated to **%s**
es: %s's el modo automático ha sido actualizado a **%s**
ja: %sの自動モードが**%s**に更新されました
pl: Tryb automatyczny %s został zaktualizowany do **%s**

# channel
source: %s's current text style is **%s**
es: %s's el estilo de texto actual es **%s**
ja: %sの現在のテキストスタイルは**%s**です
pl: Obecny styl tekstu %s to **%s**

# channel
source: %s has been removed from auto group.
es: %s ha sido eliminado del grupo automático.
ja: %sは自動グループから削除されました。
pl: %s został usunięty z automatycznych grup.

# auto
source: Group has been renamed to **%s**
es: El grupo ha sido renombrado a **%s**
ja: グループの名前が**%s**に変更されました
pl: Nazwa grupy została zmieniona na **%s**

# auto
source: Total Groups
es: Grupos totales
ja: 総グループ数
pl: Całkowita liczba Grup

# feature
source: Translate custom messages
es: Traducir mensajes personalizados
ja: カスタムメッセージの翻訳
pl: Tłumacz dowolne wiadomości

# feature
source: Translate messages by reacting with a flag emoji
es: Traducir mensajes reaccionando con una bandera de emoji
ja: 国旗絵文字リアクションでメッセージを翻訳
pl: Tłumacz wiadomości, reagując z flagowymi emotkami

# feature
source: Translate to multiple languages at once
es: Traducir a múltiples idiomas al mismo tiempo
ja: 一度に複数の言語を翻訳する
pl: Tłumacz do wielu języków naraz

# feature
source: Automatic translation of channels
es: Traducción automática de los canales
ja: チャンネルの自動翻訳
pl: Automatyczne tłumaczenie kanałów

# feature
source: Automatic translations of specific users
es: Traducción automática de usuarios específicos
ja: 特定のユーザーの自動翻訳
pl: Automatyczne tłumaczenia konkretnych użytkowników

# feature
source: Supports custom prefixes
es: Soportar prefijos personalizados
ja: カスタム接頭辞のサポート
pl: Wspiera dowolne prefiksy

# feature
source: Supports 110+ languages
es: Soporta más de 110 idiomas
ja: 110以上の言語をサポート
pl: Obsługuje 110+ języków

# feature
source: Disable
es: Deshabilitado
ja: 無効
pl: Wyłączono

# website
source: Certified by %s
es: Certificado por %s
ja: %sによって認証
pl: Certyfikowany przez %s

# company
source: Made with `❤` by %s
es: Hecho con `❤` por %s
ja: %sによって`♥`で作られた
pl: Zrobione z `❤` przez %s

# language
source: to
es: para
ja: に
pl: do

# language
source: from
es: de
ja: から
pl: z

# function
source: Stopping
es: Deteniendo
ja: 停止中
pl: Zatrzymaj tłumaczenie

# notice
source: Important
es: Importante
ja: 重要
pl: Ważne

# mention
source: @user
es: @usuario
ja: @ユーザー
pl: @użytkownik

# keyword
source: Any message ending with `%s` or `%s` will be ignored by the bot.
es: Cualquier mensaje terminando con `%s` o `%s` será ignorado por el robot.
ja: `%s`または`%s`で終わるメッセージはボットによって無視されます。
pl: Każda wiadomość zakończona `%s` lub `%s` będzie ignorowana przez bota.

# brackets
source: Any words inside %s or %s will be ignored by the bot.
es: Cualquier palabra dentro de %s o %s será ignorada por el robot.
ja: %sまたは%s内の単語はボットによって無視されます。
pl: Każde słowo wewnątrz %s lub %s będzie ignorowane przez bota.

# command
source: Default Prefix
es: Prefijo predeterminado
ja: デフォルト接頭辞
pl: Domyślny Prefiks

# translated
source: Characters Today
es: Caracteres hoy
ja: 今日の文字数
pl: Liczba znaków Dzisiaj

# translated
source: Characters this Month
es: Caracteres en el mes
ja: 今月の文字数
pl: Liczba Znaków w tym Miesiącu

# translated
source: Characters Total
es: Total de caracteres
ja: 文字数の合計
pl: Całkowita liczba Znaków

# translated
source: Messages Total
es: Mensajes totales
ja: メッセージの合計
pl: Całkowita liczba Wiadomości

# premium
source: Plan
ja: プラン

# characters
source: Per Message
es: Por mensaje
ja: メッセージあたり
pl: Na Wiadomość
