Repository: ArtanisTheOne/discord-translator-i18n
Catalog: */main.po
Languages: es, ja, pl

source: Prefer talking with a human?
es: ¿Prefieres hablar con un humano?
ja: 人と話すのが良いですか？
pl: Wolisz rozmawiać z człowiekiem?

source: We'll help you at the official server
es: Te vamos a ayudar en el servidor oficial
ja: 公式サーバーでお手伝いします
pl: Pomożemy ci na oficjalnym serwerze

source: Join the official Translator bot server
es: Unete al servidor oficial del robot traductor
ja: 翻訳ボット公式サーバーに参加する
pl: Dołącz na oficjalny serwer Translator Bota

source: Get help, report bugs or submit feedback
es: Consigue ayuda, reporta errores o danos tu retroalimentación
ja: ヘルプの参照、バグの報告、フィードバックの送信
pl: Uzyskaj pomoc, zgłoś błędy lub prześlij opinię

source: Here's the link to add **Translator** to your server:
es: Este es el link para agregar el **Traductor** a tu servidor:
ja: あなたのサーバーに**Translator**を追加するリンクはこちら :
pl: Tutaj znajduje się link do dodania **Tłumacza** na twój serwer:

source: Keep all required permissions intact for full functionality.
es: Mantener todos los permisos requeridos intactos para estar completamente funcional.
ja: 全ての機能を使うには全ての必要な権限を維持してください。
pl: Zachowaj wszystkie wymagane uprawnienia w nienaruszonym stanie, aby uzyskać pełną funkcjonalność.

source: Current bot version is %s
es: La versión actual del robot es %s
ja: 現在のボットのバージョンは%sです
pl: Obecną wersją bota jest %s

source: updates history
es: historial de actualizaciones
ja: 過去のアップデート
pl: historia aktualizacji

source: changelog
es: bitácora de cambios
ja: 更新履歴
pl: dziennik zmian

source: For more info on this command, write %s Or visit the **[wiki](%s)** or join the **[support server](%s)**.
es: Para más información de este comando, escribe %s O visita el **[wiki](%s)** o únete al **[servidor de soporte](%s)**.
ja: このコマンドの詳細については、%s または**[wiki](%s)**にアクセスするか、**[サポートサーバー](%s)**に参加してください。
pl: Aby uzyskać informacje o tej komendzie, napisz %s Lub odwiedź **[wiki](%s)** lub dołącz na **[serwer wsparcia](%s)**.

source: This message will self-destruct in 1 minute
es: Este mensaje se autodestruirá en 1 minuto
ja: このメッセージは1分後に自動的に削除されます
pl: Ta wiadomość ulegnie samodestrukcji w ciągu minuty

source: This message will self-destruct in %d minutes
es: Este mensaje se autodestruirá en %d minutos
ja: このメッセージは%d分後に自動的に削除されます
pl: Ta wiadomość ulegnie samodestrukcji w ciągu %d minut

source: Need help with bot? Check out the **[wiki](%s)** or join the **[official server](%s)**!
es: ¿Necesitas ayuda con el robot? ¡Mira el **[wiki](%s)** o únete al **[servidor oficial](%s)**!
ja: ボットのヘルプが必要ですか？**[wiki](%s)**をチェックするか**[公式サーバー](%s)**に参加してください！
pl: Potrzebujesz pomocy z botem? Sprawdź **[wiki](%s)** lub dołącz na **[oficjalny serwer](%s)**!

source: Valid Example
es: Ejemplo válido
ja: 有効な例
pl: Prawidłowy Przykład

source: Valid Examples
es: Ejemplos válidos
ja: 有効な例
pl: Prawidłowe Przykłady

source: For a full list of supported languages, [click here](%s).
es: Para una lista completa de los idiomas soportados, haz [click aquí](%s).
ja: サポートされている言語の一覧については、[こちら](%s)をご覧ください。
pl: Aby uzyskać pełną listę wspieranych języków, [kliknij tutaj](%s).

source: If you need help with that, you can visit the **[support server](%s)**.
es: Si necesitas ayuda con esto, puedes visitar el **[servidor de soporte](%s)**.
ja: もしあなたがそれについてのヘルプが必要であれば、**[サポートサーバー](%s)**に来てみてください。
pl: Jeżeli potrzebujesz z tym pomocy, udaj się na **[serwer wsparcia](%s)**.

source: Do you want it back? Share your opinion at the **[support server](%s)**.
es: ¿Lo quieres de vuelta? Comparte tu opinión en el **[servidor de soporte](%s)**.
ja: それを戻したいですか？**[サポートサーバー](%s)**であなたの意見を聞かせてください。
pl: Chcesz to z powrotem? Udostępnij nam swoją opinię na **[serwerze wsparcia](%s)**.

source: Mods/Admins Command
es: Comandos de Moderadores/Administradores
ja: 重役/管理者 コマンド
pl: Komendy Modów/Adminów

source: Admins Only
es: Solo administradores
ja: 管理者のみ
pl: Tylko dla Adminów

source: Change **%s** to **%s**
es: Cambia **%s** a **%s**
ja: **%s**を**%s**に変更してください
pl: Zmień **%s** na **%s**

source: Groups Quota
es: Cuota de grupos
ja: グループクオータ
pl: Przedział Grup

source: More info on our **[website](%s)**, or the **[support server](%s)**.
es: Más información en nuestro **[sitio web](%s)**, o en el **[servidor de soporte](%s)**.
ja: **[ウェブサイト](%s)**、または**[サポートサーバー](%s)**の詳細情報。
pl: Więcej informacji na naszej **[stronie](%s)**, lub na **[serwerze wsparcia](%s)**.

source: Linked Channels per Group Quota
es: Canales vinculados por cuota grupal
ja: グループクオータあたりのリンクされたチャンネル
pl: Powiązane Kanały na Kontyngent Grupy

source: Server Quota
es: Cuota de servidor
ja: サーバークオータ
pl: Przedział Serwera

source: Channel Information
es: Información del canal
ja: チャンネル情報
pl: Informacje Kanałowe

source: Language
es: Idioma
ja: 言語
pl: Język

source: Text Style
es: Estilo de texto
ja: テキストスタイル
pl: Styl Tekstu

source: Translations
es: Traducciones
ja: 翻訳者
pl: Tłumaczenia

source: messages
es: mensajes
ja: メッセージ
pl: wiadomości

source: Automatic Translation
es: Traducción automática
ja: 自動翻訳
pl: Automatyczne Tłumaczenie

source: Auto Group
es: Grupo automático
ja: オートグループ
pl: Automatyczna Grupa

source: Auto Groups
es: Grupos automáticos
ja: オートグループ
pl: Automatyczne Grupy

source: Auto Mode
es: Modo automático
ja: オートモード
pl: Tryb Automatyczny

source: no change
es: sin cambio
ja: 変更なし
pl: bez zmian

source: To change language, type:
es: Para cambiar idioma, escribe:
ja: 言語を変更するには、以下を入力します :
pl: Aby zmienić język, napisz:

source: Example:
es: Ejemplo:
ja: 例 :
pl: Przykład:

source: Linked Channels in Group
es: Canales vinculados en el grupo
ja: グループ内のリンクされたチャンネル
pl: Powiązane Kanały w Grupie

source: To change group, type:
es: Para cambiar el grupo, escribe:
ja: グループを変更するには、以下を入力します :
pl: Aby zmienić grupę, napisz:

source: To change mode, type:
es: Para cambiar el modo, escribe:
ja: モードを変更するには、以下を入力します :
pl: Aby zmienić tryb, napisz:

source: To change style, type:
es: Para cambiar el estilo, escribe:
ja: スタイルを変更するには、以下を入力します :
pl: Aby zmienić styl, napisz:

source: %s's text style has been updated to **%s**.
es: El estilo de texto %s's ha sido actualizado a **%s**.
ja: %sのテキストスタイルが**%s**に更新されました。
pl: Styl Tekstu %s został zaktualizowany do **%s**.

source: Automatic group **%s** has been deleted.
es: El grupo automático **%s** ha sido eliminado.
ja: 自動グループ**%s**が削除されました。
pl: Automatyczna grupa **%s** została usunięta.

source: Discord Translator is the most powerful translation bot for Discord. Based on *Google Cloud Translate* and *Discord.js*.
es: El traductor de Discord es el robot traductor más poderoso para Discord. Basado en *Google Cloud Translate* y *Discord.js*.
ja: Discord TranslatorはDiscordにとって最も強力な翻訳ボットです。 *Google Cloud Translate*と*Discord.js*に基づいています。
pl: Discord Translator to najbardziej potężny bot tłumaczeniowy na Discordzie. Bazowany na *Google Cloud Translate* i *Discord.js*.

source: Read Wiki
es: Leer el Wiki
ja: wikiを読む
pl: Przeczytaj Wiki

source: Tech support server
es: Servidor de soporte de tecnología
ja: 技術サポートサーバー
pl: Serwer wsparcia technicznego

source: Translate Text
es: Traducir texto
ja: テキストを翻訳
pl: Przetłumacz Tekst

source: Translate Channel (Automatic)
es: Traducir canal (automático)
ja: チャンネルを翻訳（自動）
pl: Przetłumacz Kanał (Automatyczne)

source: Translate User (Automatic)
es: Traducir usuario (automático)
ja: ユーザーを翻訳（自動）
pl: Tłumacz Użytkownika (Automatyczne)

source: Statistics
es: Estadísticas
ja: 統計
pl: Statystyki

source: Server Settings
es: Configuraciones del servidor
ja: サーバー設定
pl: Ustawienia Serwera

source: Text to Speech
es: Texto a voz
ja: テキスト読み上げ
pl: Syntezator Mowy

source: Translate by Reacting
es: Traducir por reacción
ja: リアクションによる翻訳
pl: Tłumacz przez Reakcję

source: Translate Other Bots
es: Traducir otros robots
ja: 他のボットを翻訳する
pl: Tłumacz Inne Boty

source: Premium Plans
es: Planes premium
ja: プレミアムプラン
pl: Plany Premium

source: Report Bugs / Request Features
es: Reportar problemas / Solicitar características
ja: バグ報告 / 機能リクエスト
pl: Zgłoś Błędy/Zaproponuj Funkcje

source: Translate Last Message(s)
es: Traducir los últimos mensajes
ja: 最後のメッセージを翻訳する
pl: Przetłumacz Ostatnią Wiadomość (-ci)

source: This command has been disabled as of v.1.0 to prevent abuse. If you want it back please let us know at the support server..
es: Este comando ha sido deshabilitado desde la versión v.1.0 para prevenir abuso. Si lo deseas de regreso, por favor hazlo saber en el servidor de soporte.
ja: このコマンドは悪用を防ぐためv.1.0では無効になっています。 もし有効にしたい場合はサポートサーバーにお知らせください。
pl: Ta komenda została wyłączona od wersji 1.0, aby zapobiec nadużyciom. Jeżeli chcesz, aby wróciła z powrotem, daj nam znać na serwerze wsparcia..

source: Translates a message in the server when you react to it with a flag emoji. For example: %s, %s, %s, %s
es: Traduce un mensaje en el servidor cuando reaccionas a el con una bandera de emoji. Por ejemplo: %s, %s, %s, %s
ja: あなたが国旗絵文字でリアクションをつけた場合、サーバーのメッセージを翻訳します。 例 :%s、%s、%s、%s
pl: Tłumaczy wiadomość na serwerze, ,jeżeli reagujesz na nią za pomocą emotki z flagą. Na przykład: %s, %s, %s, %s

source: To disable this in certain channels, do the following:
es: Para deshabilitar esta opción esto en ciertos canales, haz lo siguiente:
ja: 特定のチャンネルでこの機能を無効にするには、次の操作を行います :
pl: Aby wyłączyć to na niektórych kanałach, wykonaj następujące czynności:

source: Channel Settings > Topic Description > Write %s and save.
es: Configuraciones de canal > Descripción de temas > Escribe %s y guarda.
ja: チャンネル設定→チャンネルトピック→%sを書き込んで保存してください。
pl: Ustawienia Kanału > Opis Tematu > Napisz %s i zapisz.

source: Translate Custom Message
es: Traducir mensaje personalizado
ja: カスタムメッセージの翻訳
pl: Tłumacz Niestandardową Wiadomość

source: Translates a custom message entered by user.
es: Traducir un mensaje personalizado ingresado por un usuario.
ja: ユーザーが入力したカスタムメッセージを翻訳します。
pl: Tłumaczy niestandardową wiadomość wprowadzoną przez użytkownika.

source: #channel
es: #canal
ja: #チャンネル
pl: #kanał

source: message
es: mensaje
ja: メッセージ
pl: wiadomość

source: language(s) to translate to
es: idioma(s) a traducir
ja: 翻訳する言語
pl: język(-i) do tłumaczenia na

source: explicitly translate from this language
es: traducir explícitamente para este mensaje
ja: この言語からはっきりと翻訳する
pl: wyraźnie tłumacz z tego języka

source: forward message to specific channel
es: reenviar mensaje a un canal específico
ja: 特定のチャンネルにメッセージを転送する
pl: przekaż wiadomość do określonego kanału

source: TTS Text to Speech Translation (Experimental)
es: TTS traducción de texto a voz (experimental)
ja: TTSテキスト読み上げの翻訳（実験的）
pl: TTS Syntezator Mowy (Eksperymentalna)

source: Translates a custom message entered by user and speaks it in the user's connected voice channel.
es: Traduce un mensaje personalizado ingresado por un usuario y lo habla en el canal de voz de los usuarios conectados.
ja: ユーザーが入力したカスタムメッセージを翻訳し、ユーザーの接続されたボイスチャンネルで発言します。
pl: Tłumaczy niestandardową wiadomość wprowadzoną przez użytkownika i wypowiada ją na podłączonym kanale głosowym.

source: Examples
es: Ejemplos
ja: 例
pl: Przykłady

source: Command
es: Comando
ja: コマンド
pl: Komenda

source: Parameters
es: Parámetros
ja: パラメーター
pl: Parametry

source: Make sure bot has **Connect** and **Speak** permissions.
es: Asegúrate que el robot tiene los permisos **conectar** y **hablar**.
ja: ボットに**接続**と**発言**の権限があることを確認してください。
pl: Upewnij się, że bot ma uprawnienia **Połącz** i **Mów**.

source: Make sure you are **connected** to a Voice Channel before writing command.
es: Asegurate que estás **conectado** a un canal de voz antes de escribir el comando.
ja: コマンドを書き込む前にボイスチャンネルに**接続**されていることを確認してください。
pl: Przed wpisaniem komendy upewnij się, że jesteś **podłączony** do Kanału Głosowego.

source: View list of **Supported Voice languages**
es: Ver el listado de **idiomas de voz soportados**
ja: **サポートされている音声言語**リストを表示
pl: Wyświetl listę **Wspieranych Głosowych Języków**

source: Auto Translate Channel (Single)
es: Canal de traducción automática (un canal)
ja: 自動翻訳チャンネル（シングル）
pl: Automatyczne Tłumaczenie Kanału (Pojedyncze)

source: Add **auto-translate** inside the channel's topic description, or at the end of channel name, to automatically translate all messages in that channel to the default language.
es: Agregar la **traducción automática** adentro de la descripción del tema, o al final del nombre del canal, para traducir automáticamente todos los mensajes en ese canal a un idioma predeterminado.
ja: チャンネルのトピックの説明内、またはチャンネル名の末尾に**auto-translate**を追加すると、そのチャンネルの全てのメッセージをデフォルトの言語に自動的に翻訳できます。
pl: Dodaj **automatyczne-tłumaczenie** w opisie kanału lub na końcu nazwy kanału, aby automatycznie tłumaczyć wszystkie wiadomości na tym kanale na domyślny język.

source: Auto Translate Multiple Channels
es: Auto traducir múltiples canales
ja: 複数チャンネルの自動翻訳
pl: Automatyczne Tłumaczenie Wielu Kanałów

source: Translate new messages in channel and forward them to linked channels in the same automatic group. Supports custom modes*.
es: Traducir nuevos mensajes en el canal y reenviarlos a los canales vinculados en el mismo grupo automático. Soporta modos* automáticos.
ja: チャンネル内の新しいメッセージを翻訳し、同じ自動グループ内のリンクされたチャンネルに転送します。カスタムモードをサポートする*。
pl: Tłumacz nowe wiadomości na kanale i przekaż je do połączonych w tej samej grupie automatycznych kanałów. Obsługuje tryby niestandardowe*.

source: Current Channel Info
es: Actual información de canal
ja: 現在のチャンネル情報
pl: Obecne Informacje Kanałowe

source: Set channel's language
es: Configurar idioma del canal
ja: チャンネルの言語を設定する
pl: Ustaw język kanału

source: Set auto group
es: Configurar grupo automático
ja: 自動グループを設定する
pl: Ustaw automatyczną grupę

source: Stop/remove group
es: Detener/remover grupo
ja: グループの停止/削除
pl: Zatrzymaj/usuń grupę

source: Set sending mode
es: Configurar modo de envio
ja: 送信モードを設定する
pl: Ustaw tryb wysyłania

source: Set channel text style
es: Configurar el estilo de texto del canal
ja: チャンネルのテキストスタイルを設定する
pl: Ustaw styl tekstu kanału

source: Shortcut command
es: Comando de atajo
ja: ショートカットコマンド
pl: Skrócona komenda

source: **Modes** set a channel to send messages only, receive only or be fully synchronized (both send and receive).
es: **Modos** configura un canal para solo mandar mensajes, solo recibir o para estar completamente sincronizado (ambos modos: enviar y recibir).
ja: **モード**はメッセージのみを送信するか、完全に同期するか（送信と受信の両方）を行うチャンネルを設定します。
pl: **Tryby** ustawiają kanał do wysyłania tylko wiadomości, tylko ich odbierania lub w pełni zsynchronizowany czyli (obie te opcje)

source: Auto Translate Users
es: Traducir usuarios automáticamente
ja: 自動翻訳ユーザー
pl: Automatyczne Tłumaczenie Użytkowników

source: Automatically translates any new messages by specific users in the server (same channel).
es: Traduce automáticamente cualquier mensaje nuevo por usuario específicos en el servidor (en el mismo canal).
ja: サーバー内の特定のユーザー（同じチャンネル）によって新しいメッセージを自動的に翻訳します。
pl: Automatycznie tłumaczy wszystkie nowe wiadomości od konkretnych użytkowników na serwerze (ten sam kanał).

source: Translate user to channel's default language
es: Traducir un usuario a un idioma personalizado del canal
ja: ユーザーをチャンネルのデフォルト言語に翻訳する
pl: Tłumacz użytkownika na domyślny język kanału

source: Translate user to specific language
es: Traducir un usuario a un idioma específico
ja: ユーザーを特定の言語に翻訳する
pl: Tłumacz użytkownika na konkretny język

source: For example:
es: Por ejemplo:
ja: 例えば :
pl: Na przykład:

source: Ban Users
es: Usuarios bloqueados
ja: ユーザーをBANする
pl: Zbanuj Użytkowników

source: This requires the bot to have **Manage Roles** and **Manage Nicknames** permissions.
es: Esto requiere que el robot tenga permisos de **roles de administración** y **administrar sobrenombres**.
ja: これにはボットに**役職の管理**と**ニックネームの変更**の権限が必要です。
pl: Wymaga to uprawnień bota do **Zarządzania rolami** i **Zarządzania psełdonimami**.

source: Allow Other Bots
es: Permitir otros robots
ja: 他のボットを許可
pl: Zezwól Innym Botom

source: To allow translation of other bots, simply create a new role called %s and assign it to the bots you want. (Use at your own risk)
es: Para permitir traducciones de otros robots, simplemente crea un nuevo rol llamado %s y asígnalo a los robots que quieras (úsalo bajo tu propio riesgo).
ja: 他のボットの翻訳を許可するには、%sという名前の新しい役職を作成し、それをあなたが望むボットに割り当てます。（自己責任）
pl: Aby umożliwić tłumaczenie innych botów, wystarczy utworzyć nową rolę o nazwie %s i przypisać ją do wybranych botów. (Używasz na własne ryzyko)

source: Stop Channel Automatic Translation
es: Detener traducción automática del canal
ja: チャンネル自動翻訳を停止
pl: Zatrzymaj Automatyczne Tłumaczenia Kanału

source: Go to channel and write:
es: Ve a canal y escribe:
ja: チャンネルに行き次のように書く :
pl: Idź na kanał i napisz:

source: or
es: o
ja: または
pl: lub

source: Alternatively, change the channel's mode
es: Alternativamente, cambia el modo del canal
ja: あるいは、チャンネルのモードを変更する
pl: Ewentualnie, zmień tryb kanału

source: (receives translated messages only)
es: (solo recibir mensajes traducidos)
ja: （翻訳されたメッセージのみを受信する）
pl: (odbiera tylko przetłumaczone wiadomości)

source: (sends translated messages only)
es: (solo enviar mensajes traducidos)
ja: （翻訳されたメッセージのみを送信する）
pl: (wysyła tylko przetłumaczone wiadomości)

source: Stop User Automatic Translation
es: Detener traducción automática de usuario
ja: ユーザー自動翻訳を停止
pl: Zatrzymaj Automatyczne Tłumaczenie Użytkownika

source: Ban User from using Translator
es: Bloquear/desbloquear a un usuario de usar el traductor
ja: ユーザーがTranslatorを使用できないようにする
pl: Zbanuj Użytkownika z używania Translatora

source: Stop translating other Bots
es: Dejar de traducir otros robots
ja: 他のボットの翻訳を停止
pl: Przestań tłumaczyć inne Boty

source: Simply remove the `%s` role from the other bots.
es: Simplemente remueve el rol `%s` de otros robots.
ja: 他のボットから`%s`の役職を削除してください。
pl: Wystarczy usunąć rolę `%s` z innych botów.

source: Ignore specific messages
es: Ignorar mensajes específicos
ja: 特定のメッセージを無視
pl: Ignoruj specyficzne wiadomości

source: Ignore specific words
es: Ignorar palabras específicas
ja: 特定の単語を無視
pl: Ignoruj konkretne słowa

source: Miscellaneous Commands
es: Comandos varios
ja: その他のコマンド
pl: Rozmaite Komendy

source: Help
es: Ayuda
ja: ヘルプ
pl: Pomoc

source: Info
es: Información
ja: 情報
pl: Informacje

source: Links
es: Enlaces
ja: リンク
pl: Linki

source: Stats
es: Estadísticas
ja: 統計
pl: Statystyki

source: (bot invite link)
es: (link de invitación del robot)
ja: （ボットの招待リンク）
pl: (link zaproszenia bota)

source: (official server)
es: (servidor oficial)
ja: （公式サーバー）
pl: (oficjalny serwer)

source: Detect Language of Message
es: Detectar el idioma del lenguaje
ja: メッセージの言語を検出する
pl: Wykryj Język Wiadomości

source: You can detect the language of a message by reacting to it with a **globe** emoji (%s). Alternatively, you can use the `%s` command:
es: Puedes detectar el idioma de un mensaje reaccionando con el emoji de la **tierra** (%s). Alternativamente, puedes usar el comando `%s`:
ja: メッセージの言語は**globe**絵文字(%s)のリアクションをつけることで検出でき、`%s`コマンドを使用することでも可能です :
pl: Możesz wykryć język wiadomości reagując na nią za pomocą emotki **globusa** (%s). Alternatywnie możesz użyć również polecenia `%s`:

source: Auto Delete Bot Commands
es: Borrar automáticamente los comandos del robot
ja: ボットコマンドの自動削除
pl: Komendy Bota do Automatycznego Usuwania

source: You can choose to have the bot auto delete commands in the channel. All you have to do is write %s anywhere inside the channel's topic description.
es: Puedes escoger que el robot auto elimine los comandos en el canal. Todo lo que debes hacer es escribir %s donde sea dentro de la descripción del canal.
ja: ボットの自動削除コマンドをチャンネルに追加することができます。チャンネルのトピックの説明のどこかに%sを書き込むだけで済みます。
pl: Możesz wybrać komendy bota do automatycznego usuwania na kanale. Wszystko, co musisz zrobić, to wpisać %s w dowolnym miejscu w opisie tematu kanału.

source: This will delete all commands/messages including: help commands, settings, stats and translate commands for example:
es: Esto eliminará todos los comandos/mensajes incluyendo: comandos de ayuda, configuraciones, estadísticas y comandos de traducción por ejemplo:
ja: これらを含むコマンド/メッセージが削除されます :help、setting、stats、translate コマンドの例 :
pl: Spowoduje to usunięcie wszystkich komend/wiadomości uwzględniając: komendy pomocy, ustawień, statystyki i komendy tłumaczeń na przykład:

source: and
es: y
ja: そして
pl: i

source: Translate other Bots
es: Traducir a otros robots
ja: 他のボットを翻訳する
pl: Tłumacz inne Boty

source: By default, Translator will ignore all messages by bots, this is a common practice to avoid unpredictable behaviours and response-loops.
es: De forma predeterminada, el traductor ignorará todos los mensajes de otros bots, esta es una práctica común para evitar comportamientos impredecibles y bucles de respuestas.
ja: デフォルトでは、Translatorはボットによる全てのメッセージを無視しますが、これは予期しない動作や応答ループを避けるための一般的な方法です。
pl: Domyślnie Translator zignoruje wszystkie wiadomości pisane przez roboty, jest to powszechna praktyka, aby uniknąć nieprzewidywanych zachowań i pętli w odpowiedzi.

source: With that said, if you still wish to translate messages by other bots, you can do so by creating a member **role** called **can-translate** then assign it to the bots you wish to translate.
es: Con eso dicho, si aún deseas traducir los mensajes de otros robots, puedes hacerlo creando un **rol** de miembro llamado **can-translate** luego asignarlo a los robots que deseas traducir.
ja: ということで、他のボットでメッセージを翻訳したい場合は**can-translate**という**役職**を作成し、それを翻訳したいボットに割り当てます。
pl: Mając to na uwadze, jeśli nadal chcesz tłumaczyć wiadomości przez inne boty, możesz to zrobić tworząc **rolę** o nazwie **can-translate**, a następnie przypisując ją do botów, których chcesz przetłumaczyć.

source: Disable/Stop
es: Deshabilitar/detener
ja: 無効/停止
pl: Wyłącz/Zatrzymaj

source: Simply remove the %s role from the bots. Or delete the role itself.
es: Simplemente se debe remover el rol %s de los robots. O eliminar el rol.
ja: ボットから%sの役職を削除するだけです。または、役職自体を削除します。
pl: Wystarczy usunąć rolę %s z botów. Lub usunąć samą rolę.

source: Use at your own risk and report if you experience issues.
es: Utilícelo bajo su propio riesgo y reporte si tiene problemas.
ja: 自己責任で使用し、問題が発生した場合は報告してください。
pl: Użyj na własne ryzyko i zgłoś jeżeli wystąpią problemy.

source: Server commands are available only to server administrators.
es: Los comandos del servidos están disponibles únicamente para administradores del servidor.
ja: サーバーコマンドは、サーバー管理者のみが使用できます。
pl: Komendy serwerowe są dostępne tylko dla administratorów serwera.

source: Current Server Info
es: Información actual del servidor
ja: 現在のサーバー情報
pl: Bieżące Informacje o Serwerze

source: Set servers's default language
es: Configurar el idioma predeterminado del servidor
ja: サーバーのデフォルト言語を設定する
pl: Ustaw domyślny język serwerów

source: Set servers's custom prefix
es: Configurar el prefijo personalizado del servidor
ja: サーバーのカスタム敬称を設定する
pl: Ustaw niestandardowy prefiks serwerów

source: Set servers's default style
es: Configurar el estilo predeterminado del servidor
ja: サーバーのデフォルトスタイルを設定する
pl: Ustaw domyślny styl serwerów

source: View server's automatic groups
es: Ver los grupos automáticos del servidor
ja: サーバーの自動グループを表示する
pl: Wyświetl automatyczne grupy serwera

source: Supported Languages
es: Idiomas soportados
ja: サポートされている言語
pl: Wspierane Języki

source: For a detailed list, visit the **[wiki page](%s)**.
es: Para una lista detallada, visita la **[página wiki](%s)**.
ja: 詳細なリストについては、**[wikiページ](%s)**をご覧ください。
pl: Aby uzyskać szczegółową listę, odwiedź **[stronę wiki](%s)**.

source: Bot Info
es: Información del robot
ja: ボット情報
pl: Informacje Bota

source: Bot Version
es: Versión del robot
ja: ボットバージョン
pl: Wersja Bota

source: Bot Language
es: Idioma del robot
ja: ボット言語
pl: Język Bota

source: Global Translation Stats
es: Estadísticas de traducciones globales
ja: 全体的な翻訳の統計
pl: Globalne Statystyki Tłumaczeń

source: Total Shards
es: Total de fragmentos
ja: 全ての欠片の数
pl: Całkowita liczba Odłamków

source: Total Servers
es: Total de servidores
ja: 総サーバー数
pl: Całkowita liczba Serwerów
