Repository: ArtanisTheOne/discord-translator-i18n
Catalog: */styles.po
Languages: es, it, ja, ko, pl, zh_cn, zh_tw

source: Box - Top Avatar
es: Caja - Avatar arriba
it: Box - Avatar in alto
ja: ボックス - トップアバター
ko: 채팅 상자 - 상위에 프로필 사진
pl: Pudło - Górny Awatar
zh_cn: 格子-上边的头像
zh_tw: 格子-上邊的頭像

source: Box - Top Avatar 2
es: Caja - Avatar arriba 2
it: Box - Avatar in alto 2
ja: ボックス - トップアバター2
ko: 채팅 상자 - 상위에 프로필 사진 2
pl: Pudło - Górny Awatar 2
zh_cn: 格子-上边的头像2
zh_tw: 格子-上邊的頭像2

source: Box - Bottom Avatar
es: Caja - Avatar abajo
it: Box - Avatar in basso
ja: ボックス - ボトムアバター
ko: 채팅 상자 - 하위에 프로필 사진
pl: Pudło - Dolny Awatar
zh_cn: 格子-下边的头像
zh_tw: 格子-下邊的頭像

source: Box - No Avatar
es: Caja - Sin avatar
it: Box - Avatar mancante
ja: ボックス - アバターなし
ko: 채팅 상자 - 프로필 사진 없음
pl: Pudło - Bez Awatara
zh_cn: 格子-无头像
zh_tw: 格子-無頭像

source: Box - Big Avatar
es: Caja - Avatar grande
it: Box - Avatar Grande
ja: ボックス - 大きなアバター
ko: 채팅 상자 - 큰 프로필 사진
pl: Pudło - Duży Awatar
zh_cn: 格子-大头像
zh_tw: 格子-大頭像

source: Compact
es: Compacto
it: Compatto
ja: コンパクト
ko: 컴팩트
pl: Kompaktowy
zh_cn: 紧凑
zh_tw: 緊湊

source: Oneliner
es: Delineador
it: Una linea
ja: ワンライナー
ko: 원라이너
pl: Jednoliniowy
zh_cn: 一行
zh_tw: 一行

source: Oneliner 2
es: Delineador 2
it: Una linea 2
ja: ワンライナー2
ko: 원라이너 2
pl: Jednoliniowy 2
zh_cn: 一行2
zh_tw: 一行2

source: Header
es: Encabezado
it: Intestazione
ja: ヘッダー
ko: 헤더
pl: Nagłówek
zh_cn: 页头
zh_tw: 頁頭

source: Block
es: Bloque
it: Blocca
ja: ブロック
ko: 블럭
pl: Blok
zh_cn: 块
zh_tw: 塊

source: Webhook
ja: ウェブフック
